# · Брой пакети химикали - цяло число в интервала [0...100]
#
# · Брой пакети маркери - цяло число в интервала [0...100]
#
# · Литри препарат за почистване на дъска - цяло число в интервала [0…50]
#
# · Процент намаление - цяло число в интервала [0...100]

pen_count = int(input())
marker_count = int(input())
cleaner = int(input())
discount = float(input()) / 100


# • Пакет химикали - 5.80 лв.
#
# • Пакет маркери - 7.20 лв.
#
# • Препарат - 1.20 лв (за литър)
price = ((pen_count * 5.80) + (marker_count * 7.20) + (cleaner * 1.20))
interest = price * discount
price_with_interest = price - interest





# Да се отпечата на конзолата колко пари ще са нужни на Ани, за да си плати сметката.

print(price_with_interest)