# · Годишната такса за тренировки по баскетбол – цяло число в интервала [0… 9999]


course_price = int(input())



# • Баскетболни кецове – цената им е 40% по-малка от таксата за една година
#
# • Баскетболен екип – цената му е 20% по-евтина от тази на кецовете
#
# • Баскетболна топка – цената ѝ е 1 / 4 от цената на баскетболния екип
#
# • Баскетболни аксесоари – цената им е 1 / 5 от цената на баскетболната топка


boots = course_price * 0.6
suite = boots * 0.8
ball = suite * 0.25
accessories = ball * 0.2

course_total = boots + suite + ball + accessories + course_price



print(f'{round(course_total, 2)}')
