# 1. Дължина в см – цяло число в интервала [10 … 500]
#
# 2. Широчина в см – цяло число в интервала [10 … 300]
#
# 3. Височина в см – цяло число в интервала [10… 200]
#
# 4. Процент – реално число в интервала [0.000 … 100.000]
import math

a = int(input())
b = int(input())
c = int(input())
procent = float(input()) / 100




# Първоначално прочитаме от конзолата на отделни редове размерите му – дължина, широчина и височина в сантиметри.
# Трябва да се пресметне колко литра вода ще събира аквариума,
# ако се знае, че определен процент от вместимостта му е заета от пясък, растения, нагревател и помпа.
# Един литър вода се равнява на един кубичен дециметър/ 1л=1 дм3/.

v = a * b * c
v3 = v / 1000

l = v3 - v3 * procent

# Да се отпечата на конзолата едно число:

# · литрите вода, които ще събира аквариума.

print(l)